import json
from unittest.mock import Mock

from src.services import cashback_cat, easy_finder, find_transaction


def test_cashback_cat(data_fixture):
    assert cashback_cat(data_fixture, 2018, 1) == (
        "{\n" '  "Супермаркеты": 22.0,\n' '  "Топливо": 20.0,\n' '  "Красота": 6.0,\n' '  "Цветы": 2.0\n' "}"
    )


def test_easy_finder(data_fixture):
    input_word = Mock(return_value="Супермаркеты")
    original_input = __builtins__["input"]
    __builtins__["input"] = input_word
    result = easy_finder(data_fixture)
    assert easy_finder(data_fixture) == (
        "[\n"
        "  {\n"
        '    "Дата операции": "04.01.2018 14:05:08",\n'
        '    "Дата платежа": "06.01.2018",\n'
        '    "Номер карты": "*7197",\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -1065.9,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -1065.9,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "Супермаркеты",\n'
        '    "MCC": 5411.0,\n'
        '    "Описание": "Пятёрочка",\n'
        '    "Бонусы (включая кэшбэк)": 21,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 1065.9\n'
        "  },\n"
        "  {\n"
        '    "Дата операции": "03.01.2018 15:03:35",\n'
        '    "Дата платежа": "04.01.2018",\n'
        '    "Номер карты": "*7197",\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -73.06,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -73.06,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "Супермаркеты",\n'
        '    "MCC": 5499.0,\n'
        '    "Описание": "Magazin 25",\n'
        '    "Бонусы (включая кэшбэк)": 1,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 73.06\n'
        "  }\n"
        "]"
    )
    parsed_result = json.loads(result)
    assert len(parsed_result) == 2
    assert parsed_result[0]["Описание"] == "Пятёрочка"
    __builtins__["input"] = original_input


def test_find_transaction(data_tel_num):
    result = find_transaction(data_tel_num)
    assert find_transaction(data_tel_num) == (
        "[\n"
        "  {\n"
        '    "Дата операции": "31.01.2019 13:43:37",\n'
        '    "Дата платежа": "01.02.2019",\n'
        '    "Номер карты": "*7197",\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -82.0,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -82.0,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "Образование",\n'
        '    "MCC": 8220.0,\n'
        '    "Описание": "тест 89006657676",\n'
        '    "Бонусы (включая кэшбэк)": 1,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 82.0\n'
        "  },\n"
        "  {\n"
        '    "Дата операции": "31.01.2019 13:34:15",\n'
        '    "Дата платежа": "31.01.2019",\n'
        '    "Номер карты": 0,\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -35.0,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -35.0,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "Мобильная связь",\n'
        '    "MCC": 0,\n'
        '    "Описание": "Teletie Бизнес +7 966 000-00-00",\n'
        '    "Бонусы (включая кэшбэк)": 0,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 35.0\n'
        "  },\n"
        "  {\n"
        '    "Дата операции": "30.01.2019 19:43:01",\n'
        '    "Дата платежа": "01.02.2019",\n'
        '    "Номер карты": "*7197",\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -71.9,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -71.9,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "Супермаркеты",\n'
        '    "MCC": 5411.0,\n'
        '    "Описание": "тест 89006657676",\n'
        '    "Бонусы (включая кэшбэк)": 1,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 71.9\n'
        "  },\n"
        "  {\n"
        '    "Дата операции": "29.01.2019 09:21:34",\n'
        '    "Дата платежа": "30.01.2019",\n'
        '    "Номер карты": "*7197",\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -200.0,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -200.0,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "Связь",\n'
        '    "MCC": 4814.0,\n'
        '    "Описание": "тест +7(900) 767-77-86",\n'
        '    "Бонусы (включая кэшбэк)": 4,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 200.0\n'
        "  },\n"
        "  {\n"
        '    "Дата операции": "28.01.2019 14:40:02",\n'
        '    "Дата платежа": "28.01.2019",\n'
        '    "Номер карты": "*7197",\n'
        '    "Статус": "OK",\n'
        '    "Сумма операции": -100.0,\n'
        '    "Валюта операции": "RUB",\n'
        '    "Сумма платежа": -100.0,\n'
        '    "Валюта платежа": "RUB",\n'
        '    "Кэшбэк": 0,\n'
        '    "Категория": "НКО",\n'
        '    "MCC": 8398.0,\n'
        '    "Описание": "тест +7(900) 767-77-86",\n'
        '    "Бонусы (включая кэшбэк)": 2,\n'
        '    "Округление на инвесткопилку": 0,\n'
        '    "Сумма операции с округлением": 100.0\n'
        "  }\n"
        "]"
    )
    parsed_result = json.loads(result)
    assert len(parsed_result) == 5
    assert parsed_result[1]["Описание"] == "Teletie Бизнес +7 966 000-00-00"
